ciaa/firmware_v1/externals/drivers/msp430/inc/msp430fr6887.h
#define ESIIS2_0            (0x0000)      /* SIFIFG4 interrupt flag source: SIFCNT2 */
#define ESIIS2_1            (0x2000)      /* SIFIFG4 interrupt flag source: SIFCNT2 MOD 4 */
#define ESIIS2_2            (0x4000)      /* SIFIFG4 interrupt flag source: SIFCNT2 MOD 256 */
#define ESIIS2_3            (0x6000)      /* SIFIFG4 interrupt flag source: SIFCNT2 decrements from 01h to 00h */
#define ESIIS0_0            (0x0000)      /* SIFIFG7 interrupt flag source: SIFCNT0 */
#define ESIIS0_1            (0x0400)      /* SIFIFG7 interrupt flag source: SIFCNT0 MOD 4 */
#define ESIIS0_2            (0x0800)      /* SIFIFG7 interrupt flag source: SIFCNT0 MOD 256 */
#define ESIIS0_3            (0x0C00)      /* SIFIFG7 interrupt flag source: SIFCNT0 increments from FFFFh to 00h */

/* ESIAFE Control Bits */
#define ESIDAC2EN           (0x0800)      /* Enable ESIDAC(tsm) control for DAC in AFE2 */
#define ESICA2EN            (0x0400)      /* Enable ESICA(tsm) control for comparator in AFE2 */
#define ESICA2INV           (0x0200)      /* Invert AFE2's comparator output */
#define ESICA1INV           (0x0100)      /* Invert AFE1's comparator output */
#define ESICA2X             (0x0080)      /* AFE2's comparator input select */
#define ESICA1X             (0x0040)      /* AFE1's comparator input select */
#define ESICISEL            (0x0020)      /* Comparator input select for AFE1 only */
#define ESICACI3            (0x0010)      /* Comparator input select for AFE1 only */
#define ESISHTSM            (0x0008)      /* Sample-and-hold ESIVSS select */
#define ESIVMIDEN           (0x0004)      /* Mid-voltage generator */
#define ESISH               (0x0002)      /* Sample-and-hold enable */
#define ESITEN              (0x0001)      /* Excitation enable */

/* ESIAFE Control Bits */
#define ESICA2X_L           (0x0080)      /* AFE2's comparator input select */
#define ESICA1X_L           (0x0040)      /* AFE1's comparator input select */
#define ESICISEL_L          (0x0020)      /* Comparator input select for AFE1 only */
#define ESICACI3_L          (0x0010)      /* Comparator input select for AFE1 only */
#define ESISHTSM_L          (0x0008)      /* Sample-and-hold ESIVSS select */
#define ESIVMIDEN_L         (0x0004)      /* Mid-voltage generator */
#define ESISH_L             (0x0002)      /* Sample-and-hold enable */
#define ESITEN_L            (0x0001)      /* Excitation enable */

/* ESIAFE Control Bits */
#define ESIDAC2EN_H         (0x0008)      /* Enable ESIDAC(tsm) control for DAC in AFE2 */
#define ESICA2EN_H          (0x0004)      /* Enable ESICA(tsm) control for comparator in AFE2 */
#define ESICA2INV_H         (0x0002)      /* Invert AFE2's comparator output */
#define ESICA1INV_H         (0x0001)      /* Invert AFE1's comparator output */

#define ESIVSS              (0x0008)      /* legacy define: Sample-and-hold ESIVSS select */
#define ESIVCC2             (0x0004)      /* legacy define: Mid-voltage generator */

/* ESIPPU Control Bits */
#define ESITCHOUT1          (0x0200)      /* Latched AFE1 comparator output for test channel 1 */
#define ESITCHOUT0          (0x0100)      /* Lachted AFE1 comparator output for test channel 0 */
#define ESIOUT7             (0x0080)      /* Latched AFE2 comparator output when ESICH3 input is selected */
#define ESIOUT6             (0x0040)      /* Latched AFE2 comparator output when ESICH2 input is selected */
#define ESIOUT5             (0x0020)      /* Latched AFE2 comparator output when ESICH1 input is selected */
#define ESIOUT4             (0x0010)      /* Latched AFE2 comparator output when ESICH0 input is selected */
#define ESIOUT3             (0x0008)      /* Latched AFE1 comparator output when ESICH3 input is selected */
#define ESIOUT2             (0x0004)      /* Latched AFE1 comparator output when ESICH2 input is selected */
#define ESIOUT1             (0x0002)      /* Latched AFE1 comparator output when ESICH1 input is selected */
#define ESIOUT0             (0x0001)      /* Latched AFE1 comparator output when ESICH0 input is selected */

/* ESIPPU Control Bits */
#define ESIOUT7_L           (0x0080)      /* Latched AFE2 comparator output when ESICH3 input is selected */
#define ESIOUT6_L           (0x0040)      /* Latched AFE2 comparator output when ESICH2 input is selected */
#define ESIOUT5_L           (0x0020)      /* Latched AFE2 comparator output when ESICH1 input is selected */
#define ESIOUT4_L           (0x0010)      /* Latched AFE2 comparator output when ESICH0 input is selected */
#define ESIOUT3_L           (0x0008)      /* Latched AFE1 comparator output when ESICH3 input is selected */
#define ESIOUT2_L           (0x0004)      /* Latched AFE1 comparator output when ESICH2 input is selected */
#define ESIOUT1_L           (0x0002)      /* Latched AFE1 comparator output when ESICH1 input is selected */
#define ESIOUT0_L           (0x0001)      /* Latched AFE1 comparator output when ESICH0 input is selected */

/* ESIPPU Control Bits */
#define ESITCHOUT1_H        (0x0002)      /* Latched AFE1 comparator output for test channel 1 */
#define ESITCHOUT0_H        (0x0001)      /* Lachted AFE1 comparator output for test channel 0 */

/* ESITSM Control Bits */
#define ESICLKAZSEL         (0x4000)      /* Functionality selection of ESITSMx bit5 */
#define ESITSMTRG1          (0x2000)      /* TSM start trigger selection */
#define ESITSMTRG0          (0x1000)      /* TSM start trigger selection */
#define ESISTART            (0x0800)      /* TSM software start trigger */
#define ESITSMRP            (0x0400)      /* TSM repeat modee */
#define ESIDIV3B2           (0x0200)      /* TSM start trigger ACLK divider */
#define ESIDIV3B1           (0x0100)      /* TSM start trigger ACLK divider */
#define ESIDIV3B0           (0x0080)      /* TSM start trigger ACLK divider */
#define ESIDIV3A2           (0x0040)      /* TSM start trigger ACLK divider */
#define ESIDIV3A1           (0x0020)      /* TSM start trigger ACLK divider */
#define ESIDIV3A0           (0x0010)      /* TSM start trigger ACLK divider */
#define ESIDIV21            (0x0008)      /* ACLK divider */
#define ESIDIV20            (0x0004)      /* ACLK divider */
#define ESIDIV11            (0x0002)      /* TSM SMCLK divider */
#define ESIDIV10            (0x0001)      /* TSM SMCLK divider */

